In [1]:
import pandas as pd
purchase_1 = pd.Series({'name': 'Chris',
                       'Item Purchase': 'Dog Food',
                       'Cost': 22.50})
purchase_2 = pd.Series({'name': 'Kevyn',
                       'Item Purchase': 'Kitty Litter',
                       'Cost': 2.50})
purchase_3 = pd.Series({'name': 'Vinod',
                       'Item Purchase': 'Bird Seed',
                       'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index = ['Store 1', 'Store 2', 'Store 3'])

In [2]:
df

          name Item Purchase  Cost
Store 1  Chris      Dog Food  22.5
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [4]:
df.loc['Store 2']

name                    Kevyn
Item Purchase    Kitty Litter
Cost                      2.5
Name: Store 2, dtype: object

In [5]:
type(df.loc['Store 1'])

pandas.core.series.Series

In [9]:
df.loc[:]['Item Purchase']

Store 1        Dog Food
Store 2    Kitty Litter
Store 3       Bird Seed
Name: Item Purchase, dtype: object

In [10]:
df.loc['Store 1', 'Cost']

22.5

In [11]:
df['Cost']

Store 1    22.5
Store 2     2.5
Store 3     5.0
Name: Cost, dtype: float64

In [12]:
df.T.loc['Cost']

Store 1    22.5
Store 2     2.5
Store 3       5
Name: Cost, dtype: object

In [13]:
df

          name Item Purchase  Cost
Store 1  Chris      Dog Food  22.5
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [14]:
df.loc[:, ['name', 'Cost']]

          name  Cost
Store 1  Chris  22.5
Store 2  Kevyn   2.5
Store 3  Vinod   5.0

In [15]:
df.drop('Store 1')

          name Item Purchase  Cost
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [16]:
df

          name Item Purchase  Cost
Store 1  Chris      Dog Food  22.5
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [17]:
copy_df = df.copy()

In [18]:
copy_df

          name Item Purchase  Cost
Store 1  Chris      Dog Food  22.5
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [19]:
copy_df.drop('Store 1')

          name Item Purchase  Cost
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [20]:
copy_df

          name Item Purchase  Cost
Store 1  Chris      Dog Food  22.5
Store 2  Kevyn  Kitty Litter   2.5
Store 3  Vinod     Bird Seed   5.0

In [21]:
del copy_df['name']

In [22]:
copy_df

        Item Purchase  Cost
Store 1      Dog Food  22.5
Store 2  Kitty Litter   2.5
Store 3     Bird Seed   5.0

In [23]:
df['location'] = None

In [24]:
df

          name Item Purchase  Cost location
Store 1  Chris      Dog Food  22.5     None
Store 2  Kevyn  Kitty Litter   2.5     None
Store 3  Vinod     Bird Seed   5.0     None

In [26]:
df['Cost'] *= 0.8
df

          name Item Purchase  Cost location
Store 1  Chris      Dog Food   3.6     None
Store 2  Kevyn  Kitty Litter   0.4     None
Store 3  Vinod     Bird Seed   0.8     None